

//Реализовать  DFS и BFS для дерева с выводом каждого шага в консоль

Console.WriteLine("Hello, World!");

public class TreeNode
{
    public int Value { get; set; }
}